In [3]:
import pandas as pd 

df = pd.read_csv('./stock_data.csv', )
df_cleaned = pd.read_csv('./stock_data.csv', skiprows=1)
df_cleaned

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [5]:
df = pd.read_csv('./stock_data.csv', header=1, names=['Stock_Symbols', 'eps', 'revenue', 'price', 'people'])
df

  Stock_Symbols            eps  revenue price         people
0         GOOGL          27.82       87   845     larry page
1           WMT           4.61      484    65           n.a.
2          MSFT             -1       85    64     bill gates
3          RIL   not available       50  1023  mukesh ambani
4          TATA            5.6       -1  n.a.     ratan tata

In [7]:
df = pd.read_csv('./stock_data.csv', header=1,nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [17]:
df = pd.read_csv('./stock_data.csv', header=1, na_values=['n.a.', 'not available','-1'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [18]:
df['pe'] = df['price']/df['eps']
df

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0            NaN  14.099783
2    MSFT    NaN     85.0    64.0     bill gates        NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4    TATA   5.60      NaN     NaN     ratan tata        NaN

In [19]:
df.to_csv('pe.csv', index=False)